apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_i2c.c
  /* Enable I2C master TX interrupt */

  i2c_intr_enable(priv);

  /* Update I2C configuration */

  modifyreg32(I2C_CTR_REG(priv->id), 0, I2C_CONF_UPGATE);

  /* Configure the I2C to trigger a transaction */

  modifyreg32(I2C_CTR_REG(priv->id), 0, I2C_TRANS_START);
}

/****************************************************************************
 * Name: i2c_init_clock
 *
 * Description:
 *   Initialize I2C hardware clock.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *   bus_freq      - Clock frequency of the I2C bus in Hz.
 *
 ****************************************************************************/

static void i2c_init_clock(struct esp32s3_i2c_priv_s *priv,
                           uint32_t bus_freq)
{
  if (bus_freq == priv->clk_freq)
    {
      return;
    }

  uint32_t reg_value = 0;
  uint32_t scl_low = 0;
  uint32_t scl_high = 0;
  uint32_t scl_wait_high = 0;
  uint32_t sda_hold = 0;
  uint32_t sda_sample = 0;
  uint32_t setup = 0;
  uint32_t hold = 0;
  uint32_t timeout = 0;
  uint32_t source_clk = XTAL_CLK_FREQ;
  uint32_t clkm_div = source_clk / (bus_freq * 1024) + 1;
  uint32_t sclk_freq = source_clk / clkm_div;
  uint32_t half_cycle = sclk_freq / bus_freq / 2;

  modifyreg32(I2C_CLK_CONF_REG(priv->id), I2C_SCLK_DIV_NUM_M,
              VALUE_TO_FIELD((clkm_div - 1), I2C_SCLK_DIV_NUM));

  /* According to the Technical Reference Manual, the following timings must
   * be subtracted by 1.
   * However, according to the practical measurement and some hardware
   * behaviour, if wait_high_period and scl_high minus one. The SCL frequency
   * would be a little higher than expected. Therefore, the solution here is
   * not to minus scl_high as well as scl_wait_high, and the frequency will
   * be absolutely accurate to all frequency to some extent.
   */

  scl_low       = half_cycle;
  putreg32(scl_low - 1, I2C_SCL_LOW_PERIOD_REG(priv->id));

  /* By default, scl_wait_high must be less than scl_high.
   * A time compensation is needed for when the bus frequency is higher
   * than 50K.
   */

  scl_high      = (bus_freq <= 50000) ? half_cycle :
                                        (half_cycle / 5 * 4 + 4);
  scl_wait_high = half_cycle - scl_high;

  reg_value     = VALUE_TO_FIELD(scl_high, I2C_SCL_HIGH_PERIOD);
  reg_value    |= VALUE_TO_FIELD(scl_wait_high,
                                 I2C_SCL_WAIT_HIGH_PERIOD);
  putreg32(reg_value, I2C_SCL_HIGH_PERIOD_REG(priv->id));

  sda_hold      = half_cycle / 2;
  putreg32(sda_hold - 1, I2C_SDA_HOLD_REG(priv->id));

  /* scl_wait_high < sda_sample <= scl_high */

  sda_sample    = half_cycle / 2;
  putreg32(sda_sample - 1, I2C_SDA_SAMPLE_REG(priv->id));

  setup         = half_cycle;
  putreg32(setup - 1, I2C_SCL_RSTART_SETUP_REG(priv->id));
  putreg32(setup - 1, I2C_SCL_STOP_SETUP_REG(priv->id));

  hold          = half_cycle;
  putreg32(hold - 1, I2C_SCL_START_HOLD_REG(priv->id));
  putreg32(hold - 1, I2C_SCL_STOP_HOLD_REG(priv->id));

  /* By default, we set the timeout value to about 10 bus cycles
   * log(20*half_cycle)/log(2) = log(half_cycle)/log(2) +  log(20)/log(2)
   */

  timeout  = sizeof(half_cycle) * 8;
  timeout -= __builtin_clz(5 * half_cycle);
  timeout += 2;

  reg_value  = I2C_TIME_OUT_EN;
  reg_value |= VALUE_TO_FIELD(timeout, I2C_TIME_OUT_VALUE);
  putreg32(reg_value, I2C_TO_REG(priv->id));

  priv->clk_freq = bus_freq;
}

/****************************************************************************
 * Name: i2c_init
 *
 * Description:
 *   Initialize I2C hardware.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void i2c_init(struct esp32s3_i2c_priv_s *priv)
{
  const struct esp32s3_i2c_config_s *config = priv->config;

  if (priv->id != ESP32S3_RTC_I2C)
    {
      esp_gpiowrite(config->scl_pin, 1);
      esp_configgpio(config->scl_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
      esp_gpio_matrix_out(config->scl_pin, config->scl_outsig, 0, 0);
      esp_gpio_matrix_in(config->scl_pin, config->scl_insig, 0);

      esp_gpiowrite(config->sda_pin, 1);
      esp_configgpio(config->sda_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
      esp_gpio_matrix_out(config->sda_pin, config->sda_outsig, 0, 0);
      esp_gpio_matrix_in(config->sda_pin, config->sda_insig, 0);

      /* Enable I2C hardware */

      modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->clk_bit);
      modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->rst_bit, 0);

      /* Disable I2C interrupts */

      i2c_intr_disable(priv);

      /* Initialize I2C Master */

      putreg32(I2C_MS_MODE | I2C_CLK_EN |
               I2C_SCL_FORCE_OUT | I2C_SDA_FORCE_OUT,
               I2C_CTR_REG(priv->id));

      /* Set FIFO mode */

      modifyreg32(I2C_FIFO_CONF_REG(priv->id), I2C_NONFIFO_EN, 0);

      /* Ensure I2C data mode is set to MSB */

      modifyreg32(I2C_CTR_REG(priv->id),
                  I2C_TX_LSB_FIRST | I2C_RX_LSB_FIRST, 0);

      i2c_reset_fifo(priv);

      /* Configure the hardware filter function */

      putreg32(I2C_SCL_FILTER_EN | I2C_SDA_FILTER_EN |
              VALUE_TO_FIELD(I2C_FILTER_CYC_NUM_DEF, I2C_SCL_FILTER_THRES) |
                VALUE_TO_FIELD(I2C_FILTER_CYC_NUM_DEF, I2C_SDA_FILTER_THRES),
              I2C_FILTER_CFG_REG(priv->id));

      /* Set I2C source clock */

      modifyreg32(I2C_CLK_CONF_REG(priv->id), I2C_SCLK_SEL, 0);

      /* Configure I2C bus frequency */

      i2c_init_clock(priv, config->clk_freq);

      /* Update I2C configuration */

      modifyreg32(I2C_CTR_REG(priv->id), 0, I2C_CONF_UPGATE);
    }
#ifdef CONFIG_ESP32S3_RTC_I2C
  else
    {
      priv->config->rtc_i2c_cfg->i2c_pin_cfg.scl_io_num = config->scl_pin;
      priv->config->rtc_i2c_cfg->i2c_pin_cfg.sda_io_num = config->sda_pin;
      ulp_riscv_i2c_master_init(priv->config->rtc_i2c_cfg);
    }
#endif
}

/****************************************************************************
 * Name: i2c_deinit
 *
 * Description:
 *   Disable I2C hardware.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void i2c_deinit(struct esp32s3_i2c_priv_s *priv)
{
  const struct esp32s3_i2c_config_s *config = priv->config;

