apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_i2c.c
                  priv->ready_read = true;
                }
            }
          else /* Write operation */
            {
              i2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->bytes,
                             getreg32(I2C_SR_REG(priv->id)));
              i2c_senddata(priv);

              /* Finally sent the entire message. Update the I2C state to
               * send a stop signal in the next interrupt.
               */

              if (priv->bytes == msg->length)
                {
                  if ((msg->flags & I2C_M_NOSTOP) == 0)
                    {
                      priv->i2cstate = I2CSTATE_STOP;
                    }
#ifndef CONFIG_I2C_POLLED
                  else
                    {
                      priv->i2cstate = I2CSTATE_FINISH;
                    }
#endif
                }
            }
        }
      else if (priv->i2cstate == I2CSTATE_STOP)
        {
          /* Transmitted all data. Finish the transaction sending a stop
           * and update the I2C state.
           */

          i2c_traceevent(priv, I2CEVENT_STOP, msg->length,
                         getreg32(I2C_SR_REG(priv->id)));
          i2c_sendstop(priv);
#ifndef CONFIG_I2C_POLLED
          priv->i2cstate = I2CSTATE_FINISH;
#endif
        }
#ifndef CONFIG_I2C_POLLED
      else if (priv->i2cstate == I2CSTATE_FINISH)
        {
          /* Disable all interrupts and release the semaphore */

          i2c_intr_disable(priv);
          nxsem_post(&priv->sem_isr);
        }
#endif
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_i2cbus_initialize
 *
 * Description:
 *   Initialize the selected I2C port. And return a pointer to an unique
 *   instance of struct i2c_master_s. This function may be called to obtain
 *   multiple instances of the interface, each of which may be set up with a
 *   different frequency and slave address.
 *
 * Parameters:
 *   port          - Port number of the I2C interface to be initialized.
 *
 * Returned Value:
 *   Pointer to valid I2C device structure is returned on success.
 *   A NULL pointer is returned on failure.
 *
 ****************************************************************************/

struct i2c_master_s *esp32s3_i2cbus_initialize(int port)
{
  struct esp32s3_i2c_priv_s *priv;
#ifndef CONFIG_I2C_POLLED
  const struct esp32s3_i2c_config_s *config;
  int ret;
#endif

  switch (port)
    {
#ifdef CONFIG_ESP32S3_I2C0
      case ESP32S3_I2C0:
        priv = &g_esp32s3_i2c0_priv;
        break;
#endif
#ifdef CONFIG_ESP32S3_I2C1
      case ESP32S3_I2C1:
        priv = &g_esp32s3_i2c1_priv;
        break;
#endif
#ifdef CONFIG_ESP32S3_RTC_I2C
      case ESP32S3_RTC_I2C:
        priv = &g_esp32s3_rtc_i2c_priv;
        break;
#endif
      default:
        return NULL;
    }

  nxmutex_lock(&priv->lock);
  if (priv->refs++ != 0)
    {
      nxmutex_unlock(&priv->lock);
      return (struct i2c_master_s *)priv;
    }

#ifndef CONFIG_I2C_POLLED
  if (priv->id != ESP32S3_RTC_I2C)
    {
      config = priv->config;

      /* Set up to receive peripheral interrupts on the current CPU */

      priv->cpu = this_cpu();
      priv->cpuint = esp_setup_irq(config->periph,
                                  1,
                                  ESP_IRQ_TRIGGER_LEVEL,
                                  i2c_irq,
                                  priv);
      if (priv->cpuint < 0)
        {
          /* Failed to allocate a CPU interrupt of this type */

          priv->refs--;
          nxmutex_unlock(&priv->lock);

          return NULL;
        }

      up_enable_irq(config->irq);
    }
#endif

  i2c_init(priv);
  nxmutex_unlock(&priv->lock);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: esp32s3_i2cbus_uninitialize
 *
 * Description:
 *   De-initialize the selected I2C port and power down the device.
 *
 * Parameters:
 *   dev           - Device structure as returned by
 *                   esp32s3_i2cbus_initialize()
 *
 * Returned Value:
 *   OK is returned on success. ERROR is returned when internal reference
 *   count mismatches or dev points to invalid hardware device.
 *
 ****************************************************************************/

int esp32s3_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct esp32s3_i2c_priv_s *priv = (struct esp32s3_i2c_priv_s *)dev;

  DEBUGASSERT(dev != NULL);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  if (priv->id != ESP32S3_RTC_I2C)
    {
#ifndef CONFIG_I2C_POLLED
      up_disable_irq(priv->config->irq);
      esp_teardown_irq(priv->config->periph, priv->cpuint);
#endif

      i2c_deinit(priv);
      nxmutex_unlock(&priv->lock);
    }

  return OK;
}

#endif /* CONFIG_ESPRESSIF_I2C_PERIPH_MASTER_MODE */
